#+title: Prepare Dataset

#+property: header-args:python+ :tangle src/prepare-dataset.py :results output :session default
#+auto_tangle: t

#+begin_src python
import pandas as pd
import gutenbergpy.textget
import tensorflow as tf
#+end_src

#+RESULTS:
: 2023-05-10 17:55:50.488190: I tensorflow/tsl/cuda/cudart_stub.cc:28] Could not find cuda drivers on your machine, GPU will not be used.
: 2023-05-10 17:55:50.511500: I tensorflow/tsl/cuda/cudart_stub.cc:28] Could not find cuda drivers on your machine, GPU will not be used.
: 2023-05-10 17:55:50.511770: I tensorflow/core/platform/cpu_feature_guard.cc:182] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.
: To enable the following instructions: AVX2 FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.
: 2023-05-10 17:55:51.138635: W tensorflow/compiler/tf2tensorrt/utils/py_utils.cc:38] TF-TRT Warning: Could not find TensorRT

#+begin_src python
from pathlib import Path

data_dir=Path("./data/")
df = pd.concat([pd.read_csv(f, na_filter=True, na_values="[]") for f in data_dir.glob("genres-*.csv")], ignore_index=True)
df = df.dropna()

print(df)
#+end_src

#+RESULTS:
#+begin_example
     Text#                             Title                                             Genres
0       11  Alice's Adventures in Wonderland  ['Classics', 'Fantasy', 'Fiction', 'Childrens'...
1       12         Through the Looking-Glass  ['Classics', 'Fantasy', 'Fiction', 'Childrens'...
2       15          Moby-Dick; or, The Whale  ['Classics', 'Fiction', 'Literature', 'Adventu...
3       16                         Peter Pan  ['Classics', 'Fantasy', 'Fiction', 'Childrens'...
4       24                       O Pioneers!  ['Classics', 'Fiction', 'Historical Fiction', ...
..     ...                               ...                                                ...
294    552       The People That Time Forgot  ['Science Fiction', 'Fantasy', 'Fiction', 'Cla...
295    553               Out of Time's Abyss  ['Science Fiction', 'Fiction', 'Fantasy', 'Cla...
297    556               Rewards and Fairies  ['Fantasy', 'Classics', 'Fiction', 'Childrens'...
298    557               Puck of Pook's Hill    ['Fantasy', 'Fiction', 'Classics', 'Childrens']
299    558             The Thirty-Nine Steps  ['Fiction', 'Classics', 'Mystery', 'Thriller',...

[224 rows x 3 columns]
#+end_example

#+begin_src python
def get_text(text_id):
    raw = gutenbergpy.textget.get_text_by_id(text_id)
    clean = gutenbergpy.textget.strip_headers(raw).decode("utf-8")

    return clean

df["Text"] = [get_text(text_id) for text_id in df["Text#"]]
#+end_src

#+begin_src python
df.to_csv("./data/dataset.csv")
#+end_src

#+begin_src python
df = pd.read_csv("./data/dataset.csv")
#+end_src
